
<?php
    $f=fopen("sj.txt","r+");
    fwrite($f,"this is mehanaz fan of sj surya");
    fwrite($f,"hello surya Happy Birthday to the most special person in my life 🎉💐
From the very beginning, you have helped me in every subject, supported me in every situation, and always stood by my side. I am truly blessed to have you in my life. Your care, patience, and constant support mean the world to me. Thank you for never giving up on me and for always believing in me. I’m so grateful for you today and always. May your life be filled with happiness, success, and endless smiles 🤍✨");
     fwrite($f,"this is mehanaz fan of sj surya ");
     //this is how we give more no of fwrite operations
     //  then the content will be added at the end of the file
    rewind($f); //points to start of the file content
    //$d=fread($f,filesize("sj.txt"));
    //echo fgets($f);
    // while(!feof($f)){
    //     echo fgets($f)."<br>";
    // }
    // if(file_exists("sj.txt")){
    //     echo "yes it exist................";
    // }
    // else{
    //     echo " not found............";
    // }
    echo filesize("sj.txt");
    echo filetype("sj.txt"),"<br>";

    echo "last accessed:--".date("d-m-y H:i:s",fileatime("sj.txt")) ,"<br>";
    echo "last modified:--".date("d-m-y H:i:s",filemtime("sj.txt")) ,"<br>";
    echo "last changed:--".date("d-m-y H:i:s",filectime("sj.txt")) ,"<br>";

    echo fileowner("sj.txt");

     fclose($f);
    //echo $d;
    
?>
<?php
// $f=fopen("bunny.txt","a");
// fwrite($f,"the content will be added at the end");
// fclose($f);
?>
<?php
//echo file_get_contents("sj.txt");//without giving anything we can read file
//echo file_put_contents("sj.txt","😀😃😃😍🙁🤨🤨🥺🥺😳😳🤗🤗😕😕😕😒😒😒🤗🤗🤨🤨🙂🤩😂😂😅🥹🥹🥹😀😃😃😍🙁🤨🤨🥺🥺😳😳🤗🤗😕😕😕😒😒😒🤗🤗🤨🤨🙂🤩😂😂😅🥹🥹🥹😀😃😃😍🙁🤨🤨🥺🥺😳😳🤗🤗😕😕😕😒😒😒🤗🤗🤨🤨🙂🤩😂😂😅🥹🥹🥹😀😃😃😍🙁🤨🤨🥺🥺😳😳🤗🤗😕😕😕😒😒😒🤗🤗🤨🤨🙂🤩😂😂😅🥹🥹🥹😀😃😃😍🙁🤨🤨🥺🥺😳😳🤗🤗😕😕😕😒😒😒🤗🤗🤨🤨🙂🤩😂😂😅🥹🥹🥹😀😃😃😍🙁🤨🤨🥺🥺😳😳🤗🤗😕😕😕😒😒😒🤗🤗🤨🤨🙂🤩😂😂😅🥹🥹🥹😀😃😃😍🙁🤨🤨🥺🥺😳😳🤗🤗😕😕😕😒😒😒🤗🤗🤨🤨🙂🤩😂😂😅🥹🥹🥹😀😃😃😍🙁🤨🤨🥺🥺😳😳🤗🤗😕😕😕😒😒😒🤗🤗🤨🤨🙂🤩😂😂😅🥹🥹🥹😀😃😃😍🙁🤨🤨🥺🥺😳😳🤗🤗😕😕😕😒😒😒🤗🤗🤨🤨🙂🤩😂😂😅🥹🥹🥹😀😃😃😍🙁🤨🤨🥺🥺😳😳🤗🤗😕😕😕😒😒😒🤗🤗🤨🤨🙂🤩😂😂😅🥹🥹🥹😀😃😃😍🙁🤨🤨🥺🥺😳😳🤗🤗😕😕😕😒😒😒🤗🤗🤨🤨🙂🤩😂😂😅🥹🥹🥹😀😃😃😍🙁🤨🤨🥺🥺😳😳🤗🤗😕😕😕😒😒😒🤗🤗🤨🤨🙂🤩😂😂😅🥹🥹🥹😀😃😃😍🙁🤨🤨🥺🥺😳😳🤗🤗😕😕😕😒😒😒🤗🤗🤨🤨🙂🤩😂😂😅🥹🥹🥹😀😃😃😍🙁🤨🤨🥺🥺😳😳🤗🤗😕😕😕😒😒😒🤗🤗🤨🤨🙂🤩😂😂😅🥹🥹🥹😀😃😃😍🙁🤨🤨🥺🥺😳😳🤗🤗😕😕😕😒😒😒🤗🤗🤨🤨🙂🤩😂😂😅🥹🥹🥹😀😃😃😍🙁🤨🤨🥺🥺😳😳🤗🤗😕😕😕😒😒😒🤗🤗🤨🤨🙂🤩😂😂😅🥹🥹🥹😀😃😃😍🙁🤨🤨🥺🥺😳😳🤗🤗😕😕😕😒😒😒🤗🤗🤨🤨🙂🤩😂😂😅🥹🥹🥹😀😃😃😍🙁🤨🤨🥺🥺😳😳🤗🤗😕😕😕😒😒😒🤗🤗🤨🤨🙂🤩😂😂😅🥹🥹🥹😀😃😃😍🙁🤨🤨🥺🥺😳😳🤗🤗😕😕😕😒😒😒🤗🤗🤨🤨🙂🤩😂😂😅🥹🥹🥹😀😃😃😍🙁🤨🤨🥺🥺😳😳🤗🤗😕😕😕😒😒😒🤗🤗🤨🤨🙂🤩😂😂😅🥹🥹🥹😀😃😃😍🙁🤨🤨🥺🥺😳😳🤗🤗😕😕😕😒😒😒🤗🤗🤨🤨🙂🤩😂😂😅🥹🥹🥹😀😃😃😍🙁🤨🤨🥺🥺😳😳🤗🤗😕😕😕😒😒😒🤗🤗🤨🤨🙂🤩😂😂😅🥹🥹🥹😀😃😃😍🙁🤨🤨🥺🥺😳😳🤗🤗😕😕😕😒😒😒🤗🤗🤨🤨🙂🤩😂😂😅🥹🥹🥹😀😃😃😍🙁🤨🤨🥺🥺😳😳🤗🤗😕😕😕😒😒😒🤗🤗🤨🤨🙂🤩😂😂😅🥹🥹🥹😀😃😃😍🙁🤨🤨🥺🥺😳😳🤗🤗😕😕😕😒😒😒🤗🤗🤨🤨🙂🤩😂😂😅🥹🥹🥹😀😃😃😍🙁🤨🤨🥺🥺😳😳🤗🤗😕😕😕😒😒😒🤗🤗🤨🤨🙂🤩😂😂😅🥹🥹🥹😀😃😃😍🙁🤨🤨🥺🥺😳😳🤗🤗😕😕😕😒😒😒🤗🤗🤨🤨🙂🤩😂😂😅🥹🥹🥹😀😃😃😍🙁🤨🤨🥺🥺😳😳🤗🤗😕😕😕😒😒😒🤗🤗🤨🤨🙂🤩😂😂😅🥹🥹🥹😀😃😃😍🙁🤨🤨🥺🥺😳😳🤗🤗😕😕😕😒😒😒🤗🤗🤨🤨🙂🤩😂😂😅🥹🥹🥹😀😃😃😍🙁🤨🤨🥺🥺😳😳🤗🤗😕😕😕😒😒😒🤗🤗🤨🤨🙂🤩😂😂😅🥹🥹🥹😀😃😃😍🙁🤨🤨🥺🥺😳😳🤗🤗😕😕😕😒😒😒🤗🤗🤨🤨🙂🤩😂😂😅🥹🥹🥹😀😃😃😍🙁🤨🤨🥺🥺😳😳🤗🤗😕😕😕😒😒😒🤗🤗🤨🤨🙂🤩😂😂😅🥹🥹🥹😀😃😃😍🙁🤨🤨🥺🥺😳😳🤗🤗😕😕😕😒😒😒🤗🤗🤨🤨🙂🤩😂😂😅🥹🥹🥹😀😃😃😍🙁🤨🤨🥺🥺😳😳🤗🤗😕😕😕😒😒😒🤗🤗🤨🤨🙂🤩😂😂😅🥹🥹🥹");
//this one can overwrites every thing in the file
?>
<?php
//mkdir("uploads");
if(is_dir("uploads")){
    echo "yes it is a folder.........................";
}
?>
<?php
$s=scandir("uploads");
print_r($s);
$dir = opendir("phpcodes");

while (($file = readdir($dir)) !== false) {
    echo $file . "<br>";
}

closedir($dir);

echo "Current Directory: " . getcwd();
?>
